rails-app/app/controllers/deals_controller.rb

  def index
    view = Views::Deals::Kanban.new
    view.current_path = request.path
    view.data = Deal.includes(:agency, :recruter).all
---
SELECT "agencies".* FROM "agencies" WHERE "agencies"."id" IN (1, 2)
SELECT "deals".* FROM "deals" WHERE "deals"."agency_id" = $1  [["agency_id", 980190962]]
SELECT "recruters".* FROM "recruters"