app/views/deals/new.rb

SELECT "agencies".* FROM "agencies" ORDER BY "agencies"."name" ASC
SELECT "recruters".* FROM "recruters" ORDER BY "recruters"."name" ASC
---
                    value: "adamwathan",
                    error: "Not a valid email address."

                  section.select :agency_id,
                    label: "Agência",
                    span: 3,
                    options: agencies.map { |a| { value: a.id, label: a.name } },
                    selected: deal.agency_id

                  section.select :recruter_id,
                    label: "Recrutador",
                    span: 3,
                    options: recruiters.map { |r| { value: r.id, label: r.name } },
                    selected: deal.recruter_id,
                    disabled: true